{
  "char_to_idx": {
    "<PAD>": 0,
    "<SOS>": 1,
    "<EOS>": 2,
    " ": 3,
    "'": 4,
    "-": 5,
    ".": 6,
    "0": 7,
    "1": 8,
    "2": 9,
    "4": 10,
    "5": 11,
    "7": 12,
    "9": 13,
    "A": 14,
    "B": 15,
    "C": 16,
    "D": 17,
    "E": 18,
    "F": 19,
    "G": 20,
    "H": 21,
    "I": 22,
    "J": 23,
    "K": 24,
    "L": 25,
    "M": 26,
    "N": 27,
    "O": 28,
    "P": 29,
    "Q": 30,
    "R": 31,
    "S": 32,
    "T": 33,
    "U": 34,
    "V": 35,
    "W": 36,
    "X": 37,
    "Y": 38,
    "Z": 39,
    "a": 40,
    "b": 41,
    "c": 42,
    "d": 43,
    "e": 44,
    "f": 45,
    "g": 46,
    "h": 47,
    "i": 48,
    "j": 49,
    "k": 50,
    "l": 51,
    "m": 52,
    "n": 53,
    "o": 54,
    "p": 55,
    "q": 56,
    "r": 57,
    "s": 58,
    "t": 59,
    "u": 60,
    "v": 61,
    "w": 62,
    "x": 63,
    "y": 64,
    "z": 65
  },
  "idx_to_char": {
    "0": "<PAD>",
    "1": "<SOS>",
    "2": "<EOS>",
    "3": " ",
    "4": "'",
    "5": "-",
    "6": ".",
    "7": "0",
    "8": "1",
    "9": "2",
    "10": "4",
    "11": "5",
    "12": "7",
    "13": "9",
    "14": "A",
    "15": "B",
    "16": "C",
    "17": "D",
    "18": "E",
    "19": "F",
    "20": "G",
    "21": "H",
    "22": "I",
    "23": "J",
    "24": "K",
    "25": "L",
    "26": "M",
    "27": "N",
    "28": "O",
    "29": "P",
    "30": "Q",
    "31": "R",
    "32": "S",
    "33": "T",
    "34": "U",
    "35": "V",
    "36": "W",
    "37": "X",
    "38": "Y",
    "39": "Z",
    "40": "a",
    "41": "b",
    "42": "c",
    "43": "d",
    "44": "e",
    "45": "f",
    "46": "g",
    "47": "h",
    "48": "i",
    "49": "j",
    "50": "k",
    "51": "l",
    "52": "m",
    "53": "n",
    "54": "o",
    "55": "p",
    "56": "q",
    "57": "r",
    "58": "s",
    "59": "t",
    "60": "u",
    "61": "v",
    "62": "w",
    "63": "x",
    "64": "y",
    "65": "z"
  },
  "stat_order": [
    "atmosphere",
    "gravity",
    "resources",
    "lifesigns",
    "temperature",
    "water",
    "radiation"
  ],
  "hidden_size": 192,
  "embed_size": 64,
  "max_len": 20,
  "pad_idx": 0,
  "sos_idx": 1,
  "eos_idx": 2
}